{
  "id": "cabinet-repairs-2019",
  "title": "Cabinet Repairs",
  "subtitle": "A quick and easy fix for faded Grand Design cabinets",
  "date": "September 5, 2019",
  "category": "RV Repair",
  "readTime": "2 min read",

  "heroImage": {
    "url": "https://example.com/your-image-here.jpg",
    "caption": "Cabinet color fade and repair using a stain marker."
  },

  "tags": [
    "Grand Design",
    "RV Repair",
    "Imagine",
    "DIY",
    "Interior Fixes"
  ],

  "intro": "If you happen to own a Grand Design Imagine with the dark cabinetry, you may have noticed color fading anywhere water tends to drip. We ran into the same issue — but found a super simple fix you can store right inside your RV.",

  "sections": [
    {
      "heading": "What We Noticed",
      "paragraphs": [
        "Pretty much anywhere that water has a chance to drip, the cabinet finish tends to fade or lose color. This is especially noticeable around sinks, bathrooms, and under the kitchen counter.",
        "Ours started developing these light, worn-looking spots that made the cabinetry look older than it really was."
      ]
    },
    {
      "heading": "The Easy Fix: Minwax Stain Marker",
      "paragraphs": [
        "We found a simple solution that’s inexpensive, easy to store in the RV, and quick to apply — the **Minwax Stain Marker in Ebony**.",
        "It goes on smoothly and blends right into the dark cabinetry finish. Honestly, it’s so easy to use that even a kid could do it!"
      ]
    },
    {
      "heading": "The Results",
      "paragraphs": [
        "After applying the stain marker, the faded spots blended right in and the cabinets looked so much better. It took just a few minutes, dried quickly, and made a noticeable difference.",
        "Minwax also makes a clear coat pen, which might be worth adding afterward to seal in the color and help prevent future fading."
      ]
    }
  ],

  "quote": "It’s amazing how such a small fix can make the cabinets look like new again.",

  "noteBox": "If your Grand Design cabinets are fading, this is an easy upgrade that takes only minutes and costs under $10.",

  "noteBoxLink": "",

  "hashtags": [
    "#rvrepair",
    "#GDrv4Life",
    "#GrandDesignRVOwner",
    "#GrandDesignImagine",
    "#RVLife",
    "#HubbardsOnTheHitch"
  ]
}
