{
  "id": "newport-news-park-11-2025",
  "name": "Newport News Park Campground",
  "state": "Virginia",
  "state_code": "VA",
  "summary_text": "Nature Meets Convenience — Wooded privacy, water views, and endless places to explore nearby.",
  "address": "13564 Jefferson Ave, Newport News, VA 23603",
  "website": "https://www.visitnewportnews.com/stay/camping/",
  "reservations": "https://online.rezexpert.com/book?business_code=300026",
  "parkmap": "https://mamahubbs.github.io/hoth/maps/newport_news_camp_map.pdf",
  "latitude": 37.188648927782964,
  "longitude": -76.55836548941465,
  "amenities": {
    "electric": "Yes",
    "waterAtSite": "Yes",
    "potableFill": true,
    "sewer": "No",
    "dumpStation": true,
    "bathhouse": true,
    "laundryFacilities": true,
    "cellService": "Fair",
    "wifi": false,
    "tvCable": false,
    "petsWelcome": true,
    "dogPark": false,
    "campStore": true,
    "propaneRefill": false,
    "playground": false,
    "swimmingPool": false,
    "otherAmenities": ["N/A"]
  },
  "siteFeatures": {
    "level": "Level-ish but plan to bring some blocks and extra boards to build up as needed.",
    "dirt": ["Some"],
    "gravel": ["Some"],
    "paved": ["Some"],
    "patio": false,
    "shade": true,
    "fireRing": true,
    "picnicTable": true,
    "grill": ["As part of the fire ring"],
    "otherNotes": ["All of the sites are very well shaded so using Starlink may be a challenge. Cell phone service was strong enough for video conferencing."]
  },
  "activities": {
    "boatingLaunch": true,
    "fishing": true,
    "hiking": "Nice walkking trails throughout the park.",
    "biking": true,
    "gameRoom": false,
    "otherActivities": ["Disc Golf, Public Golf Course, Archery, 30 acre aeromodel flying field, Discovery Nature Center, Floral Gardens, Celebration of Lights drive-through Christmas lights in Dec" ]
  },
  "nearby": {
    "shopping": ["Within 15 minutes there are large shopping centers with stores such as Walmart, Target, Best Buy, Bass Pro Shops, etc."],
    "food": ["Several grocery stores within a 5-10 minute drive, plus local restaurants. There are also a few local brewing companies to visit."],
    "emergencyMedicalDistance": "10 minutes"
  },
  "favoriteSites": ["B46"],
  "photoGallery": [
    {
      "url": "https://mamahubbs.github.io/hoth/image/bluequartz01.jpg",
      "caption": "Site View"
    },
    {
      "url": "https://mamahubbs.github.io/hoth/image/bluequartz02.jpg",
      "caption": "Blue Ridge Mountains"
    },
    {
      "url": "https://mamahubbs.github.io/hoth/image/bluequartz03.jpg",
      "caption": "Happy Pups"
    },
    {
      "url": "https://mamahubbs.github.io/hoth/image/bluequartz04.jpg",
      "caption": "Sunset with a Campfire"
    },
    {
      "url": "https://mamahubbs.github.io/hoth/image/bluequartz05.jpg",
      "caption": "The Milky Way"
    },
    {
      "url": "https://mamahubbs.github.io/hoth/image/bluequartz06.jpg",
      "caption": "Sunrise Over the Vineyard"
    }
  ],
  "reviews": [
    {
      "reviewId": "newport-news-park-review-2025-11-24-01",
      "visitDate": "November 2025",
      "reviewDate": "11-24-2025",
      "starRating": 4,
      "text": "This is my second stay at Newport News Park Campground, a lovely city-run campground tucked into a beautifully wooded setting. The atmosphere is peaceful and natural, with many sites sitting along a small reservoir—having the water right outside my site made for a wonderfully relaxing stay. I loved being able to sit and look out at the water, walk my dog along the quiet loops, and explore the nearby hiking and biking trails. The campground store near the entrance is small but has the essentials. The sites are nicely spread out, giving you a real sense of privacy, and while the facilities are a bit dated, they’re fully functional and have everything you need.<br><br> One of my favorite discoveries on this trip was Grandview Nature Preserve, about a 30-minute drive away — an incredible spot for a shoreline walk and enjoying the coastal scenery. The campground’s location is also fantastic for exploring the region. You’re close to Colonial Williamsburg, Yorktown Battlefield, Jamestown Settlement, Fort Monroe, Hampton, Norfolk, and even Virginia Beach for a day trip. Norfolk itself has plenty of museums and activities, plus summer whale-watching and fishing tours if you’re looking for something extra memorable. There are also several local breweries in the area if you enjoy checking out the craft beer scene, along with shopping, restaurants, and other nature preserves. Cons: The main downside is noise. The campground is close to I-64, so road noise is noticeable throughout the day, though after a while, you start to tune it out. There’s also a train that occasionally comes through and blows its whistle. Overall: This is an amazing area to explore — from its deep historical roots to its family-friendly activities and natural beauty. Newport News Park Campground is an excellent launching point for all of it, and despite the road noise, I thoroughly enjoyed my stay and would happily return again.",
      "youtubeVideoUrl": "https://www.youtube.com/embed/xZgLLy-dJho?si=oI2ZumV1wHlXkP2n"
    }
  ]
}
